Robotzade/Rednova-Family/hardware/rednova/avr/boards.txt
##############################################################
# Rednova boards - ATmega32U4, 16 MHz, Leonardo pin mapping
##############################################################

rednova_v2.name=Rednova V2
rednova_v2.upload.tool=avrdude
rednova_v2.upload.tool.default=avrdude
rednova_v2.upload.protocol=avr109
rednova_v2.upload.maximum_size=28672
rednova_v2.upload.maximum_data_size=2560
rednova_v2.upload.speed=57600
rednova_v2.upload.disable_flushing=true
rednova_v2.upload.use_1200bps_touch=true
rednova_v2.upload.wait_for_upload_port=true
rednova_v2.build.mcu=atmega32u4
rednova_v2.build.f_cpu=16000000L
rednova_v2.build.vid=0x1209
rednova_v2.build.pid=0x0002
rednova_v2.build.usb_product="Rednova V2"
rednova_v2.build.board=REDNOVA_V2
rednova_v2.build.core=arduino:arduino
rednova_v2.build.variant=arduino:leonardo
rednova_v2.build.extra_flags={build.usb_flags} -DREDNOVA_BOARD_V2=1
rednova_v2.upload_port.0.vid=0x1209
rednova_v2.upload_port.0.pid=0x0001
rednova_v2.upload_port.1.vid=0x1209
rednova_v2.upload_port.1.pid=0x0002

##############################################################

rednova_mega.name=Rednova Mega
rednova_mega.upload.tool=avrdude
rednova_mega.upload.tool.default=avrdude
rednova_mega.upload.protocol=avr109
rednova_mega.upload.maximum_size=28672
rednova_mega.upload.maximum_data_size=2560
rednova_mega.upload.speed=57600
rednova_mega.upload.disable_flushing=true
rednova_mega.upload.use_1200bps_touch=true
rednova_mega.upload.wait_for_upload_port=true
rednova_mega.build.mcu=atmega32u4
rednova_mega.build.f_cpu=16000000L
rednova_mega.build.vid=0x1209
rednova_mega.build.pid=0x0004
rednova_mega.build.usb_product="Rednova Mega"
rednova_mega.build.board=REDNOVA_MEGA
rednova_mega.build.core=arduino:arduino
rednova_mega.build.variant=arduino:leonardo
rednova_mega.build.extra_flags={build.usb_flags} -DREDNOVA_BOARD_MEGA=1
rednova_mega.upload_port.0.vid=0x1209
rednova_mega.upload_port.0.pid=0x0003
rednova_mega.upload_port.1.vid=0x1209
rednova_mega.upload_port.1.pid=0x0004

##############################################################

rednova_micro.name=Rednova Micro
rednova_micro.upload.tool=avrdude
rednova_micro.upload.tool.default=avrdude
rednova_micro.upload.protocol=avr109
rednova_micro.upload.maximum_size=28672
rednova_micro.upload.maximum_data_size=2560
rednova_micro.upload.speed=57600
rednova_micro.upload.disable_flushing=true
rednova_micro.upload.use_1200bps_touch=true
rednova_micro.upload.wait_for_upload_port=true
rednova_micro.build.mcu=atmega32u4
rednova_micro.build.f_cpu=16000000L
rednova_micro.build.vid=0x1209
rednova_micro.build.pid=0x0006
rednova_micro.build.usb_product="Rednova Micro"
rednova_micro.build.board=REDNOVA_MICRO
rednova_micro.build.core=arduino:arduino
rednova_micro.build.variant=arduino:leonardo
rednova_micro.build.extra_flags={build.usb_flags} -DREDNOVA_BOARD_MICRO=1
rednova_micro.upload_port.0.vid=0x1209
rednova_micro.upload_port.0.pid=0x0005
rednova_micro.upload_port.1.vid=0x1209
rednova_micro.upload_port.1.pid=0x0006
